app/controllers/school_classes_controller.rb

    def create
        # @school_class = SchoolClass.new(school_class_params)
        # @school_class.save
        @school_class= SchoolClass.create(school_class_params)
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "title1"], ["room_number", ""], ["created_at", "2019-11-26 01:09:45.765916"], ["updated_at", "2019-11-26 01:09:45.765916"]]