app/controllers/students_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", nil], ["last_name", nil], ["updated_at", "2019-11-25 00:45:03.464484"], ["id", 1]]
---
      def edit
        @student = Student.find(params[:id])
        @student.update(first_name: params[:first_name], last_name:
        params[:last_name])